//////////////////////////////////////////////////////////////////////////////
// JS работает в одном потоке !!!!!!!!!!!
// JS ассинхронный с помощью  EventLoop 
//////////////////////////////////////////////////////////////////////////////

const first = () => console.log('first')
const second = () => console.log('second')
const third = () => console.log('third')

first()

// JS не знает как работать с ассинхронными функциями, js использует сторонний API 
setTimeout(() => {second()}, 0)

third()